[
  {
    "關係代號": "LH_公司法_民法",
    "主法規": "公司法",
    "關聯法規": "民法",
    "階層關係類型": "上位概念",
    "關聯說明": "《民法》作為普通法，其關於行為能力、委任、債權債務、損害賠償、連帶責任、質權、抵押權、保證、抵銷、消滅時效等一般原則，在公司法無特別規定的情況下，補充適用於公司法相關事項。例如公司法第一百九十二條規定董事與公司間關係依民法委任規定；第九十七條清算人與公司關係準用民法委任規定；第一六一條之二、第二百五十七條之二提及設質不適用民法第九百零八條，反面解釋表示民法質權規定原則上適用；第二百九十六條準用破產法破產債權節規定但排除別除權、優先權規定，而別除權、優先權等概念源於民法及其他法律。",
    "台灣觀點": "台灣的公司法脫胎於歐陸法系，與民法有著緊密的聯繫。民法提供了公司法賴以建立的基礎法律概念和原則，是理解公司法許多規定的重要上位法，特別是在涉及公司對外關係、內部委任關係、債務處理等方面。"
  },
  {
    "關係代號": "LH_公司法_民事訴訟法",
    "主法規": "公司法",
    "關聯法規": "民事訴訟法",
    "階層關係類型": "補充法規",
    "關聯說明": "公司法中涉及法院管轄、聲請、裁定、判決、訴訟程序、保全處分、提存、確認之訴等事項，準用《民事訴訟法》的相關規定。例如公司法第二百一十四條股東代公司起訴、第二百九十九條債權或股東權之確認之訴、第三百十四條重整程序之準用民事訴訟法等。",
    "台灣觀點": "公司法涉及的許多法律爭議和程序性事項（如撤銷股東會決議、解任董事、公司重整、清算聲請等），最終都需要透過司法程序解決。民事訴訟法提供了這些程序進行的具體規範，是公司法在司法實踐中的重要配套法規。"
  },
  {
    "關係代號": "LH_公司法_行政程序法",
    "主法規": "公司法",
    "關聯法規": "行政程序法",
    "階層關係類型": "上位概念",
    "關聯說明": "公司法中涉及主管機關（如經濟部、直轄市政府）辦理登記、核准、命令、裁罰等行政行為時，除公司法有特別規定外，應遵循《行政程序法》關於行政行為基本原則、聽證程序、行政處分、送達等規定。",
    "台灣觀點": "雖然公司法並未直接準用行政程序法，但作為規範行政機關行為的普通法，行政程序法的原則和程序對於主管機關執行公司法業務具有指導和補充作用，確保行政行為的合法性與正當性，尤其在涉及對公司或其負責人做出行政處分時。"
  },
  {
    "關係代號": "LH_公司法_強制執行法",
    "主法規": "公司法",
    "關聯法規": "強制執行法",
    "階層關係類型": "補充法規",
    "關聯說明": "公司法中涉及債務清償、財產處分、股東權利收回（如拍賣股份）、重整計畫執行、罰鍰拒繳等事項，若需強制執行，則應依《強制執行法》的規定辦理。",
    "台灣觀點": "強制執行法是實現債權、執行法院判決或行政裁罰的最後一道防線。在公司法相關的債務糾紛或股權執行等情形中，強制執行法提供了具體的執行程序和方法。"
  },
  {
    "關係代號": "LH_公司法_破產法",
    "主法規": "公司法",
    "關聯法規": "破產法",
    "階層關係類型": "平行法規",
    "關聯說明": "公司法與《破產法》皆處理企業的清算或重整，但適用條件和程序不同。公司法在清算（第三百三十五條特別清算準用第二百九十四條破產程序停止）、重整（第二百八十二條需有重整可能，第二百八十三條之一公司已宣告破產者駁回聲請，第二百八十五條之一駁回重整聲請如合於破產規定得宣告破產，第二百九十四條重整程序停止破產程序，第三百零六條、第三百零七條、第三百五十五條終止重整如合於破產規定得宣告破產）及債權處理（第二百九十六條重整債權準用破產法債權節規定）等程序中，與破產法存在密切關聯，並在特定情況下將公司的處理導向破產程序。",
    "台灣觀點": "破產法提供了一套更為全面的債務清理機制，公司法在特定情況下會將公司的處理導向破產程序，或在重整/清算中準用破產法的特定規則，兩者是處理企業經營失敗後果的兩套相關但不完全重疊的法律機制。"
  },
  {
    "關係代號": "LH_公司法_證券交易法",
    "主法規": "公司法",
    "關聯法規": "證券交易法",
    "階層關係類型": "補充法規",
    "關聯說明": "對於公開發行股票之公司，《證券交易法》及其依其授權訂定的相關行政規則，對公司法的部分條文有特別規定或排除適用（如第一五六條、一五六條之一、一五七條、一六一條之一、一七二條、一七二條之一、一七二條之二、一七五條之一、一七七條、一七七條之一、一七七條之三、一八一條、一八五條、一九二條之一、一九七條之一、一九九條、二零一條、二零四條、二零五條、二零九條、二一零條、二一零條之一、二一六條、二一六條之一、二一七條之一、二一八條、二二八條之一、二四零條、二四七條、二四八條、二四八條之一、二六七條、二六八條、二六九條、二七零條、二七一條、二七二條、二七三條、二七七條、三一六條、三六九條之十二等），形成對公開發行公司更嚴格或不同的規範。",
    "台灣觀點": "證券交易法是為了監管資本市場、保護投資人而制定，對於公開發行公司有額外的義務和限制。因此，公開發行公司在適用公司法時，必須同時遵守證券交易法的特別規定，證券交易法及其子法規在許多方面補充或修改了公司法對公開發行公司的適用。"
  },
  {
    "關係代號": "LH_公司法_刑法",
    "主法規": "公司法",
    "關聯法規": "刑法",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法部分條文規定了公司負責人或其他人員違反特定義務時的刑事責任（如第九條、第六十三條、第九十條、第二百三十二條、第二百九十三條、第三百條、第三百一十三條、第三百七十一條、第三百七十二條、第二百五十九條等），這些刑事責任的構成通常會涉及刑法中的概念（如偽造文書、詐欺、背信、侵占等）。",
    "台灣觀點": "公司法中的刑事責任條款是對公司治理行為的一種外部約束，與刑法共同構成了對不法行為的懲罰機制，旨在遏止公司內部的舞弊行為。"
  },
  {
    "關係代號": "LH_公司法_組織犯罪防制條例",
    "主法規": "公司法",
    "關聯法規": "組織犯罪防制條例",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法第三十條將曾犯《組織犯罪防制條例》規定之罪並經有罪判決確定者，列為不得充任經理人或當然解任的事由。",
    "台灣觀點": "此規定連結了公司治理與犯罪防制，目的是防止組織犯罪勢力滲透公司，影響正常經營。"
  },
  {
    "關係代號": "LH_公司法_貪污治罪條例",
    "主法規": "公司法",
    "關聯法規": "貪污治罪條例",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法第三十條將曾犯《貪污治罪條例》之罪並經判決有罪確定者，列為不得充任經理人或當然解任的事由。",
    "台灣觀點": "此規定旨在提升公司負責人的清廉性要求，特別是對於可能涉及公共事務或與政府往來的公司，防止貪腐行為影響公司運作或公共利益。"
  },
  {
    "關係代號": "LH_公司法_工會法",
    "主法規": "公司法",
    "關聯法規": "工會法",
    "階層關係類型": "相關法規",
    "關聯說明": "《工會法》界定了工會的組成和類型，公司法第二百八十二條將符合特定條件的工會列為公司重整的聲請人之一。",
    "台灣觀點": "這是公司法與勞動法規體系的一個交集，體現了在公司面臨重大財務危機時，員工及其組織在法律程序中的參與權益，保障勞方權益。"
  },
  {
    "關係代號": "LH_公司法_勞工保險條例",
    "主法規": "公司法",
    "關聯法規": "勞工保險條例",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法第二百八十二條於計算聲請公司重整的受僱員工數時，以聲請時公司《勞工保險條例》的投保名冊人數為準。",
    "台灣觀點": "勞工保險名冊是台灣判斷受僱員工身份和人數的重要依據，此處體現了不同法律規定在實際操作中的相互引用，使用了勞保資料作為判斷重整聲請資格的依據之一。"
  },
  {
    "關係代號": "LH_公司法_律師法",
    "主法規": "公司法",
    "關聯法規": "律師法",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法部分條文規定股東、監察人等可委託律師協助查閱公司文件或辦理相關事務（如第二百零五條、第二百一十八條、第二百二十九條），登記申請也可委任律師代理（第三百八十七條）。律師的資格和執業規範依《律師法》規定。",
    "台灣觀點": "律師在公司法相關的法律事務中扮演重要角色，律師法規範了他們的專業行為和資格，確保服務品質和法律程序的順利進行。"
  },
  {
    "關係代號": "LH_公司法_會計師法",
    "主法規": "公司法",
    "關聯法規": "會計師法",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法規定公司資本額查核（第七條）、財務報表查核簽證（第二十條、第二百二十八條之一公開發行公司部分）、監察人委託會計師查核（第二百一十八條、第二百一十九條）、股東委託會計師查閱（第二百二十九條）、登記申請委任會計師代理（第三百八十七條）等事項。會計師的資格和執業規範依《會計師法》規定。",
    "台灣觀點": "會計師在公司法規定的財務透明、資本真實以及相關文件審核方面起著關鍵作用，會計師法規範了他們的專業行為和資格，確保財務資訊的準確性和可靠性。"
  },
  {
    "關係代號": "LH_公司法_銀行法",
    "主法規": "公司法",
    "關聯法規": "銀行法",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法提及代收股款/公司債款之銀行（第一百三十三條、第二百四十八條、第二百七十三條）、公司債債權人受託人以金融或信託事業為限（第二百四十八條），這些機構的設立和業務規範主要依《銀行法》等金融法規。",
    "台灣觀點": "銀行等金融機構是公司營運中重要的資金管道和服務提供者，銀行法等確保了這些機構的穩健經營和合法性，以保護存款人、債權人及市場穩定。"
  },
  {
    "關係代號": "LH_公司法_信託業法",
    "主法規": "公司法",
    "關聯法規": "信託業法",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法提及公司債債權人受託人以金融或信託事業為限（第二百四十八條），以及股東可成立股東表決權信託由受託人行使表決權（第一百七十五條之一、第三百五十六條之九）。信託業的設立和業務規範主要依《信託業法》規定。",
    "台灣觀點": "信託業法規範了信託機構的運作，為公司法中涉及信託安排（如公司債受託、股東表決權信託）提供了法律基礎，增加了公司治理和債權保障的彈性與工具。"
  },
  {
    "關係代號": "LH_公司法_貿易法",
    "主法規": "公司法",
    "關聯法規": "貿易法",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法第三百九十二條之一規定，公司外文名稱登記不得與依貿易法令登記在先之出進口廠商外文名稱相同，此處連結到《貿易法》或其他相關貿易管理法規（如出進口廠商登記辦法）。",
    "台灣觀點": "公司名稱涉及商業識別和貿易活動，此規定協調了公司登記與貿易廠商登記之間的名稱使用問題，避免混淆，維護市場秩序。"
  },
  {
    "關係代號": "LH_公司法_稅法",
    "主法規": "公司法",
    "關聯法規": "稅法 (泛指)",
    "階層關係類型": "相關法規",
    "關聯說明": "公司法涉及盈餘分派需完納稅捐（第二百三十二條）、虧損彌補（第二百二十八條、第二百三十二條）、特定期間淨利計算（第二百四十九條、第二百五十條、第二百六十九條）、員工酬勞相關稅務處理等事項，需參照所得稅法等相關稅法規定。",
    "台灣觀點": "公司的財務運作與稅務緊密相關，公司法中的相關規定需要結合稅法來理解和執行，確保公司在分配利潤和處理財務時符合稅務規範。"
  },
  {
    "關係代號": "LH_公司法_公司登記辦法",
    "主法規": "公司法",
    "關聯法規": "公司登記辦法",
    "階層關係類型": "下位行政規則",
    "關聯說明": "公司法第三百八十七條授權中央主管機關訂定公司登記相關辦法，規範各項登記的期限、文件、書表及其他事項，例如《公司登記辦法》。",
    "台灣觀點": "公司登記辦法是經濟部依公司法授權訂定的重要行政規則，提供了公司辦理設立、變更、解散等各項登記的具體操作細節，是實務上最常被參考的配套法規之一，具有直接拘束力。"
  },
  {
    "關係代號": "LH_公司法_商業會計法及相關準則",
    "主法規": "公司法",
    "關聯法規": "商業會計法及相關準則",
    "階層關係類型": "下位行政規則",
    "關聯說明": "公司法規定財務報表應依中央主管機關規定之規章編造（第二百二十八條），這些規章主要包括《商業會計法》及依其授權訂定的相關會計處理準則。",
    "台灣觀點": "公司的會計處理和財務報告是公司治理和資訊透明的重要環節，商業會計法及其準則為公司提供了統一的會計規範基礎，是編制公司法要求之財務報表的重要依據。"
  },
  {
    "關係代號": "LH_公司法_證券交易法相關行政規則",
    "主法規": "公司法",
    "關聯法規": "證券交易法相關行政規則 (泛指)",
    "階層關係類型": "補充行政規則",
    "關聯說明": "公司法中多處提及公開發行公司應依證券主管機關之規定辦理或由其定之，這些規定散見於證券交易法授權訂定的各種行政規則（如發行處理準則、股務處理準則、公開發行公司股東會議事手冊應行記載及準則、公開發行公司財務報告編製準則、公開發行公司取得或處分資產處理準則等）。這些規則補充了公司法和證券交易法中較為原則性的規定。",
    "台灣觀點": "對於公開發行公司而言，這些證券交易法下的行政規則是適用公司法時必須同時遵守的具體細則，它們在公司法對公開發行公司的基礎框架下，提供了更為詳細和嚴格的操作規範，是實務中公開發行公司必須高度關注的法規群。"
  }
]