[
  {
    "關係代號": "LH_強制執行法_民事訴訟法_上位概念",
    "主法規": "強制執行法",
    "關聯法規": "民事訴訟法",
    "階層關係類型": "上位概念",
    "關聯說明": "強制執行法為民事訴訟法的後續程序法規，許多執行程序、原則及概念（如裁判種類、和解、調解等執行名義來源，以及訴訟程序的準用）都以民事訴訟法為基礎或直接準用其規定（例如第18條、第30-1條等）。可視為其上位或基礎性法規。",
    "台灣觀點": "在台灣，民事訴訟法與強制執行法是民事程序法體系的兩大支柱，民事訴訟法確立權利，強制執行法實現權利，兩者緊密相連，實務上必須相互參照適用。"
  },
  {
    "關係代號": "LH_強制執行法_民法_上位概念",
    "主法規": "強制執行法",
    "關聯法規": "民法",
    "階層關係類型": "上位概念",
    "關聯說明": "強制執行法所執行的債權或物權等私法上權利，其存在、內容及效力主要依據民法或其他私法規定。例如民法第151條的自助行為作為執行聲請依據，以及抵押權、所有權、租賃關係等物權或債權概念皆源於民法。民法為基礎實體法，強制執行法為實現其權利的程序法，故視為上位概念。",
    "台灣觀點": "民法是台灣私法體系的基礎，強制執行法是保障民法上權利實現的最後一道防線。理解強制執行，必須先對民法上的權利義務關係有所認識。"
  },
  {
    "關係代號": "LH_強制執行法_行政執行法_平行法規",
    "主法規": "強制執行法",
    "關聯法規": "行政執行法",
    "階層關係類型": "平行法規",
    "關聯說明": "行政執行法與強制執行法分別規範公法上金錢債權與私法上金錢請求權的執行程序。兩者處理的執行對象不同，但在實務上可能遇到競合（如同一財產同時被民事執行處與行政執行署查封），法條中（第33-1條、33-2條、122-1條等）規範了處理競合及公法人財產執行的特殊規則，顯示兩者為平行但需協調的法規。",
    "台灣觀點": "台灣的執行體系分為民事執行（由法院民事執行處辦理）與行政執行（由行政執行署辦理），各有其主管法規，但當涉及公法人財產或查封競合時，兩者之間會有條文上的聯繫與協調機制。"
  },
  {
    "關係代號": "LH_強制執行法_海商法_補充法規",
    "主法規": "強制執行法",
    "關聯法規": "海商法",
    "階層關係類型": "補充法規",
    "關聯說明": "強制執行法第114條規定，對於船舶的強制執行，除本法另有規定外，準用不動產執行規定，但同時提及海商法所定船舶。海商法規範船舶的特殊法律關係（如優先權、抵押權等），強制執行法在執行船舶時，需補充適用海商法關於船舶性質及權利的特別規定。",
    "台灣觀點": "船舶因其特殊性質，在法律上常有特別規範。強制執行法在執行船舶時，除了適用通則及不動產執行原則外，還需考量海商法的特殊規定，例如優先權的處理等。"
  },
  {
    "關係代號": "LH_強制執行法_民用航空法_補充法規",
    "主法規": "強制執行法",
    "關聯法規": "民用航空法",
    "階層關係類型": "補充法規",
    "關聯說明": "強制執行法第114-4條規定，對於航空器的強制執行，除本法另有規定外，準用船舶執行規定。民用航空法規範航空器的特殊法律關係（如國籍、登記、抵押權等），強制執行法在執行航空器時，需補充適用民用航空法關於航空器性質及權利的特別規定。",
    "台灣觀點": "航空器與船舶類似，因其移動性及價值高等特性，法律上亦有特別規範。強制執行法在執行航空器時，同樣需要補充考量民用航空法的相關規定。"
  },
  {
    "關係代號": "LH_強制執行法_公證法_參考法規",
    "主法規": "強制執行法",
    "關聯法規": "公證法",
    "階層關係類型": "參考法規",
    "關聯說明": "強制執行法第4條將依公證法規定得為強制執行之公證書列為執行名義之一。公證法規範公證書的製作與效力，強制執行法引用公證法作為執行名義的來源之一，故為參考法規。",
    "台灣觀點": "公證制度在台灣提供另一種取得執行名義的途徑，特別是在債務人願意配合公證的情況下，可以免去訴訟程序，加速債權實現。"
  },
  {
    "關係代號": "LH_強制執行法_刑事訴訟法_參考法規",
    "主法規": "強制執行法",
    "關聯法規": "刑事訴訟法",
    "階層關係類型": "參考法規",
    "關聯說明": "強制執行法第22-5條規定，關於拘提、管收，除本法別有規定外，準用刑事訴訟法關於拘提、羈押之規定。強制執行程序中的人身自由限制措施（拘提、管收）準用刑事訴訟法的相關規定，故為參考法規。",
    "台灣觀點": "雖然是民事執行，但涉及人身自由限制時，基於人權保障，強制執行法特別準用刑事訴訟法中對人身自由限制較為嚴謹的程序規定。"
  },
  {
    "關係代號": "LH_強制執行法_國有財產法_參考法規",
    "主法規": "強制執行法",
    "關聯法規": "國有財產法",
    "階層關係類型": "參考法規",
    "關聯說明": "強制執行法第122-4條規定，債務人管有之非公用財產等仍得為強制執行，不受國有財產法等法令有關處分規定之限制。強制執行法在此例外排除了國有財產法等對公有財產處分的限制，顯示強制執行法在特定情況下優於或排除國有財產法的適用，故國有財產法為強制執行法在處理公有財產時需參考或互動的法規。",
    "台灣觀點": "國有財產的管理涉及公共利益，通常有較嚴格的處分限制。但在債務人為公法人且有債務不履行時，強制執行法為了保障債權人權益，特別規定某些公有財產仍可強制執行，這是特別法優於普通法的展現。"
  },
  {
    "關係代號": "LH_強制執行法_土地法_參考法規",
    "主法規": "強制執行法",
    "關聯法規": "土地法",
    "階層關係類型": "參考法規",
    "關聯說明": "與國有財產法類似，土地法亦規範土地的權利、處分等事項，強制執行法第122-4條提及公法人財產執行不受土地法等法令處分規定之限制。土地法是規範土地權利的重要基礎法規，在強制執行不動產時，其權利變動、登記等會涉及土地法相關規定，故為參考法規。",
    "台灣觀點": "土地法是台灣不動產法律的重要基礎，強制執行不動產時，其拍賣、移轉登記等程序及效力，都會與土地法上的規定產生關聯或互動。"
  },
  {
    "關係代號": "LH_強制執行法_社會福利及社會保險相關法規_參考法規",
    "主法規": "強制執行法",
    "關聯法規": "社會福利及社會保險相關法規",
    "階層關係類型": "參考法規",
    "關聯說明": "強制執行法第122條規定，依法領取之社會福利津貼、社會救助或補助、社會保險給付等不得為強制執行。這些給付的來源及性質由各種社會福利及社會保險法規（如社會救助法、國民年金法、勞工保險條例等）規定。強制執行法參考這些法規所創設的權利類型，以決定其是否為不得執行之財產，故為參考法規。",
    "台灣觀點": "台灣的社會福利和社會保險體系旨在保障國民基本生活，因此相關給付在強制執行法中被特別列為禁止執行的項目，體現了社會政策的考量。"
  },
  {
    "關係代號": "LH_強制執行法_刑法_參考法規",
    "主法規": "強制執行法",
    "關聯法規": "刑法",
    "階層關係類型": "參考法規",
    "關聯說明": "強制執行法第59條等條文提及損壞、除去或污穢查封標示或為違背其效力之行為有刑法處罰。刑法規範妨害執行等犯罪行為，強制執行法引用刑法的規定作為執行程序中的違法行為的法律後果依據，故為參考法規。",
    "台灣觀點": "為了確保強制執行的順利進行和法律的權威性，對於妨礙執行的行為，強制執行法連結到刑法的相關處罰規定，具有嚇阻作用。"
  }
]