[
  {
    "關係代號": "LH_政資法_憲法",
    "主法規": "政府資訊公開法",
    "關聯法規": "中華民國憲法",
    "階層關係類型": "上位概念",
    "關聯說明": "政府資訊公開法保障人民知的權利，此項權利源自中華民國憲法對基本人權的保障，特別是言論自由、新聞自由等，亦可視為衍生自憲法保障之受益權。因此，憲法是政府資訊公開法的最高位階法源。",
    "台灣觀點": "資訊公開、人民知的權利在台灣被認為是落實民主憲政、監督政府的重要基礎，雖然憲法未明文列舉「知的權利」，但實務上多將其解釋為受憲法基本權利保障的內涵之一。"
  },
  {
    "關係代號": "LH_政資法_中央法規標準法",
    "主法規": "政府資訊公開法",
    "關聯法規": "中央法規標準法",
    "階層關係類型": "上位概念",
    "關聯說明": "中央法規標準法規範中央法規的制定、公布、施行、修正、廢止等事項，並規定法律、命令、行政規則等法規範的位階與形式。政府資訊公開法第七條列舉應主動公開的資訊類型時，提及條約、法律、緊急命令、命令、法規命令、地方自治法規等，這些法規範的分類與位階依據中央法規標準法。",
    "台灣觀點": "中央法規標準法是台灣中央法規體系的重要基礎法，理解其規定有助於正確適用政府資訊公開法中關於不同類型法規資訊的公開要求，確保法規體系的安定性。"
  },
  {
    "關係代號": "LH_政資法_行政程序法",
    "主法規": "政府資訊公開法",
    "關聯法規": "行政程序法",
    "階層關係類型": "上位概念",
    "關聯說明": "行政程序法作為行政行為的普通法，規範行政機關行使公權力之一般程序。政府資訊公開法規範政府資訊公開的特別程序，屬於行政程序的一環。在政府資訊公開法未特別規定的事項，行政程序法的相關規定（例如關於文書格式、送達、陳述意見等）仍有補充適用之餘地。",
    "台灣觀點": "行政程序法是台灣行政法制現代化的重要里程碑，政府資訊公開法與之共同建構透明、公開、民主的行政體系。兩者關係為特別法優先於普通法，但普通法的基本原則與未盡事宜仍適用。"
  },
  {
    "關係代號": "LH_政資法_訴願法",
    "主法規": "政府資訊公開法",
    "關聯法規": "訴願法",
    "階層關係類型": "上位概念",
    "關聯說明": "政府資訊公開法第二十條規定，申請人對於政府機關就其申請提供、更正或補充政府資訊所為之決定不服者，得依法提起行政救濟。此行政救濟程序的第一階段即是依訴願法規定向原處分機關或其上級機關提起訴願。",
    "台灣觀點": "訴願法是台灣人民對行政機關違法或不當行政處分尋求內部救濟的主要管道，政府資訊公開法的相關決定亦納入此救濟體系，保障人民權益。"
  },
  {
    "關係代號": "LH_政資法_行政訴訟法",
    "主法規": "政府資訊公開法",
    "關聯法規": "行政訴訟法",
    "階層關係類型": "上位概念",
    "關聯說明": "政府資訊公開法第二十條規定之行政救濟，經訴願決定後，申請人如仍不服，得依行政訴訟法規定向行政法院提起行政訴訟，尋求司法救濟。",
    "台灣觀點": "行政訴訟法是台灣人民對行政行為尋求外部司法救濟的最終途徑，確保政府資訊公開相關爭議能透過獨立公正的司法程序獲得最終解決。"
  },
  {
    "關係代號": "LH_政資法_國家機密保護法",
    "主法規": "政府資訊公開法",
    "關聯法規": "國家機密保護法",
    "階層關係類型": "上位概念",
    "關聯說明": "政府資訊公開法第十八條第一款規定，經依法核定為國家機密或其他法律、法規命令規定應秘密事項者，應限制公開或不予提供。國家機密保護法即為規範國家機密範圍、核定與解除等事項的法律，其規定對於政府資訊公開法中涉及國家機密的資訊具有優先適用之效力。",
    "台灣觀點": "國家機密保護法代表國家安全與資訊公開之間的平衡考量，其對國家機密的認定及保護要求，在特定情況下優先於政府資訊公開的普遍原則。"
  },
  {
    "關係代號": "LH_政資法_個人資料保護法",
    "主法規": "政府資訊公開法",
    "關聯法規": "個人資料保護法",
    "階層關係類型": "補充法規",
    "關聯說明": "政府資訊公開法第十八條第六款規定，公開或提供有侵害個人隱私者，應限制公開或不予提供。個人資料保護法詳細規範個人資料的定義、蒐集、處理、利用等，為判斷政府資訊公開是否侵害個人隱私的重要依據。",
    "台灣觀點": "在台灣，政府資訊公開與個人資料保護是處理政府資料時經常需要同時考量的兩大原則。個人資料保護法提供個人隱私權的具體保障框架，補充了政府資訊公開法在涉及個人資訊時的限制規定。"
  },
  {
    "關係代號": "LH_政資法_著作權法",
    "主法規": "政府資訊公開法",
    "關聯法規": "著作權法",
    "階層關係類型": "補充法規",
    "關聯說明": "政府資訊公開法第十八條第六款規定，公開或提供有侵害著作權人之公開發表權者，應限制公開或不予提供。著作權法詳細規範著作權的內容與權利限制，為判斷政府資訊公開是否侵害著作權的重要依據。",
    "台灣觀點": "政府機關公開或提供資訊時，若該資訊內容涉及第三方的著作權，必須遵守著作權法的規定，以免侵權。著作權法為政府資訊公開法在處理第三方著作資訊時提供了行為規範。"
  },
  {
    "關係代號": "LH_政資法_營業秘密法",
    "主法規": "政府資訊公開法",
    "關聯法規": "營業秘密法",
    "階層關係類型": "補充法規",
    "關聯說明": "政府資訊公開法第十八條第七款規定，公開或提供有侵害個人、法人或團體營業上秘密者，應限制公開或不予提供。營業秘密法詳細規範營業秘密的定義與保護，為判斷政府資訊公開是否涉及營業秘密的重要依據。",
    "台灣觀點": "營業秘密法保障企業的智慧財產權，政府資訊公開法在促進透明的同時，也透過引用營業秘密法的概念來平衡企業的合法權益，避免因公開資訊損害企業競爭力。"
  },
  {
    "關係代號": "LH_政資法_施行細則",
    "主法規": "政府資訊公開法",
    "關聯法規": "政府資訊公開法施行細則",
    "階層關係類型": "上位概念",
    "關聯說明": "政府資訊公開法為母法，授權相關機關（通常為主管機關）訂定施行細則，詳細規範本法條文的具體執行細節與操作程序。施行細則位階上屬於法規命令，低於法律。",
    "台灣觀點": "施行細則在台灣法規體系中扮演補充法律、方便實務操作的重要角色，與母法共同構成完整的法規範體系，是政府機關與人民在適用政府資訊公開法時必須同時參照的重要規範。"
  }
]